# 누락된 데이터 처리하기

In [1]:
import pandas as pd
import numpy as np

In [2]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [3]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

pandas에서는 R프로그래밍 언어에서 결측치를 $NA^{(Not Available)}$로 취급하는 개념을 차용했다.  
파이썬 내장 None 값 또한 NA 값으로 취급된다.

In [4]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

NA 처리 메서드  

|인자 | 설명 |
|---------|----------------|
|dropna | 누락된 데이터가 있는 축을 제외시킨다. |
|fillna | 누락된 데이터를 대신할 값을 채우거나 'ffill'이나 'bfill' 같은 보간 메서드를 적용한다. |
|isnull | 누락되거나 NA인 값을 알려주는 불리언값이 저장된 객체를 반환한다. |
|notnull | isnull과 반대되는 메서드 |

## 누락된 데이터 골라내기

In [5]:
from numpy import nan as NA

data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [6]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

dropna는 기본적으로 NA값을 포함하고 있는 로우를 제외시킨다.

In [7]:
data = pd.DataFrame([[1., 6., 3.], [1., NA, NA], [NA, NA, NA],[NA, 6., 3.]])
cleaned = data.dropna()
data

     0    1    2
0  1.0  6.0  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.0  3.0

In [8]:
cleaned

     0    1    2
0  1.0  6.0  3.0

how='all' 옵션을 넘기면 모두 NA 값 로우만 제외

In [9]:
data.dropna(how='all')

     0    1    2
0  1.0  6.0  3.0
1  1.0  NaN  NaN
3  NaN  6.0  3.0

In [10]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.0  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.0  3.0 NaN

In [11]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.0  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.0  3.0

axis=1 로 넘겨주면 컬럼을 제외시킨다.

In [12]:
df = pd.DataFrame(np.random.randn(7,3))

df.iloc[:4,1]= NA
df.iloc[:2, 2] = NA
df

          0         1         2
0 -0.584243       NaN       NaN
1 -0.157332       NaN       NaN
2  1.211062       NaN  0.003919
3  0.535800       NaN  0.597669
4 -0.550589  1.440276 -1.433259
5  0.074752  1.360827 -0.441161
6  0.403047  0.959482 -0.457973

In [13]:
df.dropna()

          0         1         2
4 -0.550589  1.440276 -1.433259
5  0.074752  1.360827 -0.441161
6  0.403047  0.959482 -0.457973

NA값이 몇 개 이상의 값만 제외시키기

In [14]:
df.dropna(thresh=2)

          0         1         2
2  1.211062       NaN  0.003919
3  0.535800       NaN  0.597669
4 -0.550589  1.440276 -1.433259
5  0.074752  1.360827 -0.441161
6  0.403047  0.959482 -0.457973

## 결측치 채우기

In [15]:
df.fillna(0) # 결측치를 0으로 채운다.

          0         1         2
0 -0.584243  0.000000  0.000000
1 -0.157332  0.000000  0.000000
2  1.211062  0.000000  0.003919
3  0.535800  0.000000  0.597669
4 -0.550589  1.440276 -1.433259
5  0.074752  1.360827 -0.441161
6  0.403047  0.959482 -0.457973

In [16]:
df.fillna({1: 0.5, 2: 0}) # 각 컬럼마다 다른 값을 채울 수 있다.

          0         1         2
0 -0.584243  0.500000  0.000000
1 -0.157332  0.500000  0.000000
2  1.211062  0.500000  0.003919
3  0.535800  0.500000  0.597669
4 -0.550589  1.440276 -1.433259
5  0.074752  1.360827 -0.441161
6  0.403047  0.959482 -0.457973

In [17]:
_ = df.fillna(0, inplace=True)
df # 기존 객체를 변경했다.

          0         1         2
0 -0.584243  0.000000  0.000000
1 -0.157332  0.000000  0.000000
2  1.211062  0.000000  0.003919
3  0.535800  0.000000  0.597669
4 -0.550589  1.440276 -1.433259
5  0.074752  1.360827 -0.441161
6  0.403047  0.959482 -0.457973

In [18]:
df= pd.DataFrame(np.random.randn(6,3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0  0.347513 -0.235821  2.050444
1  0.362240 -0.143458 -0.240212
2  0.014250       NaN  1.319395
3  2.336759       NaN  0.680442
4 -1.001317       NaN       NaN
5  0.618338       NaN       NaN

In [19]:
df.fillna(method='ffill') #ffill 직전의 값으로 채운다

          0         1         2
0  0.347513 -0.235821  2.050444
1  0.362240 -0.143458 -0.240212
2  0.014250 -0.143458  1.319395
3  2.336759 -0.143458  0.680442
4 -1.001317 -0.143458  0.680442
5  0.618338 -0.143458  0.680442

In [20]:
df.fillna(method='ffill', limit=2) #limit 제한 개수를 정한다.

          0         1         2
0  0.347513 -0.235821  2.050444
1  0.362240 -0.143458 -0.240212
2  0.014250 -0.143458  1.319395
3  2.336759 -0.143458  0.680442
4 -1.001317       NaN  0.680442
5  0.618338       NaN  0.680442

In [21]:
data = pd.Series([1,NA,3,NA,7])
data.fillna(data.mean()) #NA를 제외하고 평균값을 계산하여 채워 넣는다.

0    1.000000
1    3.666667
2    3.000000
3    3.666667
4    7.000000
dtype: float64

fillna 함수 인자

|인자 | 설명 |
|---------------|--------------------|
|value | 비어있는 값을 채울 스칼라값이나 사전 현식의 객체 |
| method | 보간 방식, 기본 'ffill' |
| axis | 축 |
| implace | 복사본을 생성하지 않고 호출한 객체를 변경 |
| limit | 값을 몇 개 까지 채울지 |

# 데이터 변형

## 중복 제거하기

In [22]:
data = pd.DataFrame({'k1':['one','two']*3 + ['two'],
                    'k2':[1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [23]:
data.duplicated() #중복인지 아닌지 알려준다.

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [24]:
data.drop_duplicates() #중복된 인자를 제거한다./ duplicated()에 False를 반환한다.

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [25]:
data['v1'] = range(7)
data.drop_duplicates(['k1']) # k1 컬럼을 기반으로 중복을 걸러낸다.

    k1  k2  v1
0  one   1   0
1  two   1   1

In [26]:
data.drop_duplicates(['k1','k2'], keep='last') # 중복중 마지막 값을 반환한다.

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

## 함수나 매핑을 이용해서 데이터 변형하기

In [27]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami', 'corned beef', 'Bacon',
                             'pastrami', 'honey ham', 'nova lox'],
                    'ounces': [4, 3, 12, 6, 7, 8, 3, 5, 6]})
data

          food  ounces
0        bacon       4
1  pulled pork       3
2        bacon      12
3     Pastrami       6
4  corned beef       7
5        Bacon       8
6     pastrami       3
7    honey ham       5
8     nova lox       6

In [28]:
meat_to_animal={
    'bacon': 'pig',
    'pulled pork': 'cow',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}

In [29]:
lowercased = data['food'].str.lower() # 모두 소문자로 변경
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [30]:
data['animal'] = lowercased.map(meat_to_animal) # data에 새로운 컬럼('animal')을 추가하고 'meat_to_animal'데이터를 넣는다.
data

          food  ounces  animal
0        bacon       4     pig
1  pulled pork       3     cow
2        bacon      12     pig
3     Pastrami       6     cow
4  corned beef       7     cow
5        Bacon       8     pig
6     pastrami       3     cow
7    honey ham       5     pig
8     nova lox       6  salmon

In [31]:
data['food'].map(lambda x: meat_to_animal[x.lower()]) # 'lowercased.map(meat_to_animal)'랑 같다

0       pig
1       cow
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

## 값 치환하기

In [32]:
data = pd.Series([1, -999, 2, -999, -1000, 3], dtype=float)
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [33]:
data.replace(-999, NA) #-999를 NA값으로 취급한다.

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [34]:
data.replace([-999,-1000], NA) # 여러 값도 가능

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [35]:
data.replace([-999,-1000], [NA,0]) # 따로 치환 가능

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [36]:
data.replace({-999:NA, -1000:0}) #사전도 가능

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

## 축 색인 이름 바꾸기

In [52]:
data = pd.DataFrame(np.arange(12).reshape((3,4)),
                   index = ['Ohio','Colorad','New York'],
                   columns=['One','Two','Three','Four'])

In [53]:
transform = lambda x: x[:4].upper() # 4글자 까지만 사용
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [54]:
data.index = data.index.map(transform)
data

      One  Two  Three  Four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

원래 객체를 변경하지 않고 새로운 객체를 생성하려면 rename 메서드를 사용

In [56]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [60]:
data.rename(index={'OHIO':'INDIANA'},
           columns={'Three':'peekaboo'})

         One  Two  peekaboo  Four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

원본 데이터를 바로 변경하려면 inplace= True

In [61]:
data.rename(index={'OHIO':'INDIANA'}, inplace=True)
data

         One  Two  Three  Four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

## 개별화와 양자화

In [66]:
ages = [20,22,25,27,23,37,45,34,23,16,93]

In [67]:
bins=[18,25,35,60,100] #그룸 18~25, 26~35,...

In [68]:
cats=pd.cut(ages,bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (35.0, 60.0], (25.0, 35.0], (18.0, 25.0], NaN, (60.0, 100.0]]
Length: 11
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [69]:
cats.codes

array([ 0,  0,  0,  1,  0,  2,  2,  1,  0, -1,  3], dtype=int8)

In [71]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [73]:
pd.value_counts(cats) # 중괄호 포함 안하고 대괄호 쪽만 포함

(18, 25]     5
(25, 35]     2
(35, 60]     2
(60, 100]    1
dtype: int64

In [74]:
pd.cut(ages,bins, right=False) #괄호를 조정할 수 있다.

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [35.0, 60.0), [25.0, 35.0), [18.0, 25.0), NaN, [60.0, 100.0)]
Length: 11
Categories (4, interval[int64, left]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [75]:
group_names = ['Y','A','M','S']

In [76]:
pd.cut(ages, bins, labels=group_names) # labels 옵션으로 그룹 이름 설정 가능

['Y', 'Y', 'Y', 'A', 'Y', ..., 'M', 'A', 'Y', NaN, 'S']
Length: 11
Categories (4, object): ['Y' < 'A' < 'M' < 'S']

In [77]:
data = np.random.rand(20)

In [79]:
pd.cut(data, 4, precision=2) # 4개의 그룹으로 균등분포/ precision 옵션은 소수점 아래 2자리까지로 제한

[(0.76, 0.99], (0.54, 0.76], (0.76, 0.99], (0.099, 0.32], (0.099, 0.32], ..., (0.54, 0.76], (0.099, 0.32], (0.54, 0.76], (0.76, 0.99], (0.099, 0.32]]
Length: 20
Categories (4, interval[float64, right]): [(0.099, 0.32] < (0.32, 0.54] < (0.54, 0.76] < (0.76, 0.99]]

cut 함수는 분산에 따라 나뉜다.  
qcut 은 표준 변위치를 사용하여 그룹을 나눈다.

In [83]:
data = np.random.randn(1000)

In [84]:
cats=pd.qcut(data,4) # 4분위로 분류
cats

[(0.00225, 0.761], (-3.121, -0.667], (0.761, 3.89], (0.761, 3.89], (-0.667, 0.00225], ..., (0.761, 3.89], (-3.121, -0.667], (-0.667, 0.00225], (0.00225, 0.761], (-0.667, 0.00225]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.121, -0.667] < (-0.667, 0.00225] < (0.00225, 0.761] < (0.761, 3.89]]

In [85]:
pd.value_counts(cats) # qcut

(-3.121, -0.667]     250
(-0.667, 0.00225]    250
(0.00225, 0.761]     250
(0.761, 3.89]        250
dtype: int64

In [86]:
cats=pd.cut(data,4) # cut
pd.value_counts(cats)

(-1.367, 0.385]     543
(0.385, 2.138]      357
(-3.127, -1.367]     84
(2.138, 3.89]        16
dtype: int64

In [87]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.]) # 변위치를 직접 지정할 수 있다. 0~1으로 %느낌

[(0.00225, 1.365], (-3.121, -1.266], (1.365, 3.89], (0.00225, 1.365], (-1.266, 0.00225], ..., (0.00225, 1.365], (-1.266, 0.00225], (-1.266, 0.00225], (0.00225, 1.365], (-1.266, 0.00225]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.121, -1.266] < (-1.266, 0.00225] < (0.00225, 1.365] < (1.365, 3.89]]

## 특잇값을 찾고 제외하기

In [89]:
data = pd.DataFrame(np.random.randn(1000,4))

In [90]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.042210    -0.029530     0.004977     0.001183
std       0.980128     0.985434     1.046862     1.009099
min      -3.278216    -3.098698    -3.937389    -3.329232
25%      -0.655976    -0.693956    -0.726823    -0.650544
50%      -0.025965    -0.019914     0.013165    -0.019356
75%       0.624544     0.623574     0.743517     0.704354
max       3.121439     3.083594     3.375871     3.169316

In [93]:
col = data[2]
col[np.abs(col)>3] # 절댓값이 3초과하는 경우

12     3.002402
425   -3.937389
727    3.055295
757   -3.445522
790    3.375871
Name: 2, dtype: float64

In [94]:
data[(np.abs(data)>3).any(1)] # 절댓값 3초과하는 값이 들어있는 로우 반환

            0         1         2         3
12  -0.746386  0.758151  3.002402 -1.812118
72  -3.278216 -0.741791  1.047412 -0.432009
117  0.686716 -3.098698  0.424041 -0.703790
178  0.355502  0.279821  0.308106 -3.329232
282  0.819113 -0.171456 -0.291132  3.009621
374 -0.558485  3.083594  0.009913 -0.164167
425  0.052017  0.295895 -3.937389 -0.430763
502  3.121439  1.405584  0.384558  0.908107
600 -3.046370  1.888804 -1.694161  0.441372
727 -0.683158 -0.378611  3.055295  0.740098
757  0.570160 -1.009853 -3.445522  0.439054
790  0.105330 -1.672169  3.375871  0.681376
906  3.055203 -0.054302  1.049204 -0.475099
981  0.449527 -0.041268  2.002658  3.169316

In [98]:
data[np.abs(data)>3] = np.sign(data)*3 # 절댓값 3초과하는 값 +-3으로 만듬

In [97]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.042062    -0.029515     0.005927     0.001333
std       0.978548     0.984871     1.041046     1.007518
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.655976    -0.693956    -0.726823    -0.650544
50%      -0.025965    -0.019914     0.013165    -0.019356
75%       0.624544     0.623574     0.743517     0.704354
max       3.000000     3.000000     3.000000     3.000000

In [99]:
np.sign(data) # 양수인지 음수인지에 따라 1, -1 반환

       0    1    2    3
0   -1.0 -1.0  1.0  1.0
1    1.0  1.0 -1.0 -1.0
2   -1.0 -1.0 -1.0 -1.0
3    1.0  1.0  1.0  1.0
4    1.0 -1.0 -1.0 -1.0
..   ...  ...  ...  ...
995  1.0 -1.0 -1.0 -1.0
996  1.0  1.0  1.0  1.0
997 -1.0  1.0 -1.0  1.0
998  1.0 -1.0  1.0  1.0
999  1.0 -1.0  1.0  1.0

[1000 rows x 4 columns]

## 치환과 임의 샘플링

In [100]:
df = pd.DataFrame(np.arange(5*4).reshape((5,4)))

In [110]:
sampler = np.random.permutation(5) # 0~4사이 숫자 랜덤 배열 반환

In [111]:
sampler

array([3, 2, 1, 4, 0])

In [112]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [113]:
df.take(sampler) # sampler로 로우 바꾸기

    0   1   2   3
3  12  13  14  15
2   8   9  10  11
1   4   5   6   7
4  16  17  18  19
0   0   1   2   3

In [114]:
df.sample(n=3) #치환 없이 일부만 임의로 선택

    0   1   2   3
3  12  13  14  15
1   4   5   6   7
4  16  17  18  19

In [115]:
choices = pd.Series([5, 7, -1, 6, 4])

In [124]:
draws = choices.sample(n=10, replace=True) # replace=True 반복 선택 허용
draws

2   -1
4    4
4    4
0    5
0    5
1    7
2   -1
1    7
1    7
4    4
dtype: int64

## 표시자/더미 변수 계산하기

In [26]:
df = pd.DataFrame({"key": ["b", "b", "a", "c", "a", "b"],
                   "data1": range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [27]:
pd.get_dummies(df['key']) # 더미나 표시자 행렬로 전환

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [28]:
dummies = pd.get_dummies(df['key'], prefix='key') #  컴럼에 접두어를 추가

In [30]:
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [32]:
mnames = ['movie_id', 'title','genres']
movies = pd.read_table('datasets/movielens/movies.dat', sep='::', header=None, names=mnames)

In [33]:
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

장르 추출

In [34]:
all_genres = []

for x in movies.genres:
    all_genres.extend(x.split('|'))

genres = pd.unique(all_genres)
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [43]:
zero_matrix = np.zeros((len(movies), len(genres)))
dummies = pd.DataFrame(zero_matrix, columns=genres)
dummies

,Animation,Children's,Comedy,Adventure,Fantasy,Romance,Drama,Action,Crime,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western
0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3881,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3882,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [54]:
gen = movies.genres[0]

gen.split('|')

['Animation', "Children's", 'Comedy']

In [56]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2], dtype=int64)

In [48]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i,indices] = 1

In [60]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                              1.0
Genre_Children's                             1.0
Genre_Comedy                                 1.0
Genre_Adventure                              0.0
Genre_Fantasy                                0.0
Genre_Romance                                0.0
Genre_Drama                                  0.0
Genre_Action                                 0.0
Genre_Crime                                  0.0
Genre_Thriller                               0.0
Genre_Horror                                 0.0
Genre_Sci-Fi                                 0.0
Genre_Documentary                            0.0
Genre_War                                    0.0
Genre_Musical                                0.0
Genre_Mystery                                0.0
Genre_Film-Noir                              0.0
Genre_Western                                0.0
Name: 0, dtype: object

---------

In [64]:
np.random.seed(12345)

In [65]:
values= np.random.rand(10)

In [66]:
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [67]:
bins = [0,0.2,0.4,0.6,0.8,1]

In [68]:
pd.get_dummies(pd.cut(values,bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

# 문자열 다루기

## 문자열 객체 메서드

In [1]:
val = 'a,b, guido'

`split() 분리 함수`

In [2]:
val.split(',')

['a', 'b', ' guido']

`strip() 공백 제거`

In [3]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [4]:
first, second, third = pieces

In [6]:
first + '::' + second + '::' + third

'a::b::guido'

In [7]:
'::'.join(pieces) #좀더 파이썬 스러운 방식

'a::b::guido'

In [8]:
'guido' in val

True

`index, find` 위치 찾기

In [10]:
val.index(',') # index는 없으면 에러 발생

1

In [11]:
val.find(':')

-1

In [12]:
val.count(',') # 개수 반환

2

In [13]:
val.replace(',', '::') # ','를 '::' 로 변환

'a::b:: guido'

In [14]:
val.replace(',', '')

'ab guido'

## 정규 표현식
정규 표현식은 텍스트에서 문자열 패턴을 찾는 유연한 방법을 제공한다.

In [15]:
import re

In [16]:
text = 'foo bar\t baz \tqux'

In [17]:
re.split('\s+', text) # \s+ : 하나 이상의 공백

['foo', 'bar', 'baz', 'qux']

In [21]:
regex = re.compile('\s+') # re.compile을 이용해서 정규 표현식 객체를 만들어 사용하면 CPU  사용량을 아낄 수 있다.

In [19]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [22]:
regex.findall(text)

[' ', '\t ', ' \t']

예제 : 이메일 주소를 검사하는 정규 표현식

In [23]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryam@yahoo.com
"""

pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

regex = re.compile(pattern, flags= re.IGNORECASE) #re.IGNORECASE는 정규 표현식이 대소문자를 가리지 않도록 한다.

In [24]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryam@yahoo.com']

In [26]:
m = regex.search(text)
m #첫 번째 이메일의 주소만 찾아준다.

In [28]:
text[m.start():m.end()]

'dave@google.com'

In [29]:
print(regex.match(text)) # 문자열 시작점에서 부터 검사한다

None

In [30]:
print(regex.sub('REDACTED', text)) #찾은 패턴을 주어진 문자열로 치환

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [31]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})' #이름, 도메인 이름, 도메인 접미사 세 가지 컴포넌트로 나눠야 한다면

In [32]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [33]:
m = regex.match('wes@bringht.net')
m.groups()

('wes', 'bringht', 'net')

In [34]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryam', 'yahoo', 'com')]

In [35]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryam, Domain: yahoo, Suffix: com

## pandas의 벡터화된 문자열 함수

In [39]:
data = {'Dave': 'dave@google.com','Steve':'steve@gmail.com',
       'Rob': 'rob@gmail.com', 'Wes':np.nan}
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [40]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [41]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [42]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [43]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [45]:
matches = data.str.match(pattern, flags=re.IGNORECASE)
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object